
[
    {
      "personalInfo": {
        "id": "bs0416",
        "name": "মোঃ লতিফুর রহমান",
        "title": "সিনিয়র ইউআই ইঞ্জিনিয়ার",
        "pictureUrl": "https://www.nop-station.com/images/thumbs/0002616_Latifur%20Rahman_267.webp",
        "summary": "ইন্ডাস্ট্রিতে 6 বছরের বেশি অভিজ্ঞতা সহ একজন সিনিয়র UI ইঞ্জিনিয়ার হিসাবে, আমি আপনার প্রতিষ্ঠানের জন্য ব্যতিক্রমী ফ্রন্ট-এন্ড ডেভেলপমেন্ট সমাধান প্রদান করার ক্ষমতার প্রতি আত্মবিশ্বাসী। আমি HTML5, CSS, JavaScript, jQuery, SASS এবং Next.js-এ দক্ষতা সহ একজন অত্যন্ত দক্ষ বিকাশকারী। আমি ক্ষেত্রের সর্বশেষ অগ্রগতির সাথে আপ-টু-ডেট থাকার মাধ্যমে শ্রেষ্ঠত্বের জন্য প্রতিশ্রুতিবদ্ধ, এবং আমার জ্ঞান আমাকে গতিশীল এবং আকর্ষক ওয়েব সমাধান তৈরি করতে সাহায্য করে যা ব্যতিক্রমী ব্যবহারকারীর অভিজ্ঞতা প্রদান করে।"
      },
      "education": {
        "lastDegree": "BSC",
        "institute": "Northern University Bangladesh",
        "group": "CSE",
        "passingYear": 2015
      },
      "training": [
        {
          "name": "Web Design",
          "year": 2016,
          "institute": "BITM Institute",
          "address": "BITM, BDBL Bhaban (3rd Floor - East), 12 Kawran Bazar, Dhaka -1215."
        },
        {
          "name": "National ICT Internship Program (Batch # 13)",
          "year": "2013-2014",
          "institute": "Bangladesh Computer Council",
          "address": "E-14/X, BCC Bhaban, Statistics Road, Dhaka 1207"
        }
      ],
      "achievement": [
        "nopCommerce certified developer"
      ],
      "technicalSkill": [
        {
          "name": "HTML5",
          "level": 10
        },
        {
          "name": "CSS",
          "level": 10
        },
        {
          "name": "JavaScript",
          "level": 8
        },
        {
          "name": "React",
          "level": 8
        },
        {
          "name": "Next.js",
          "level": 7
        },
        {
          "name": "JQuery",
          "level": 9
        },
        {
          "name": "Bootstrap Framework",
          "level": 10
        },
        {
          "name": "Photoshop",
          "level": 7
        },
        {
          "name": "SASS",
          "level": 10
        },
        {
          "name": "Web API",
          "level": 7
        }
      ],
      "experience": [
        {
          "title": "Senior UI Engineer",
          "company": "Brain Station 23 Limited",
          "startDate": "Jul 2022",
          "endDate": "CONTINUE"
        },
        {
          "title": "UI Engineer",
          "company": "Brain Station 23 Limited",
          "startDate": "Aug 2021",
          "endDate": "Jul 2022"
        },
        {
          "title": "Junior UI Engineer",
          "company": "Brain Station 23 Limited",
          "startDate": "Apr 2018",
          "endDate": "Aug 2021"
        },
        {
          "title": "Frontend Developer and Trainer (Web Design)",
          "company": "PONDIT.COM",
          "startDate": "Jan 2017",
          "endDate": "Mar 2018"
        },
        {
          "title": "Instructor",
          "company": "NIT",
          "startDate": "Mar 2015",
          "endDate": "Dec 2016"
        }
      ],
      "projects" : [
          {
              "name": "NRBBAZAAR",
              "technologyUsed": "Ajax, Jquery, SQL, Asp.net core",
              "technicalResponsibility": "My job responsibilities included ensuring that the UI components were responsive and accessible on different devices and screen sizes. Additionally, I would have been responsible for ensuring that the UI design was consistent and adhered to any design guidelines or specifications provided by the project manager or designer.",
              "projectLink": "https://www.nrbbazaar.com/",
              "projectDuration": "",
              "shortDescription": "NRB Bazaar is a product of MARS Solutions Limited, a leading IT Service Provider in Bangladesh, with the goal to revolutionize the e-commerce industry in the country, aiming to serve a worldwide customer base. We helped them develop a class-leading solution using nopCommerce that features custom business logic and functionality that ensures a simple customer journey, enhanced customer experience, and optimized order processing. The solution helped NRB Bazar establish a strong online presence, introduce the facility for new customers to order online, and provide a new experience for its existing and new customer base"
            },
            {
              "name": "SUPERLIQUOR",
              "technologyUsed": "SQL, Ajax, Jquery",
              "technicalResponsibility": "I was responsible for ensuring that these UI components were responsive, accessible, and adhered to any design guidelines or specifications provided by the project manager or designer. My role also involved collaborating with other members of the development team, such as back-end developers, to ensure seamless integration of UI components with the overall application or website functionality.",
              "projectLink": "https://www.superliquor.co.nz/",
              "projectDuration": "",
              "shortDescription": "Super Liquor, a popular liquor retail chain with a proud and successful history of liquor retailing throughout New Zealand, however they did not have an online ordering facility for customers. We built their first hyperlocal multi-store eCommerce store using the nopCommerce platform, allowing customers to place orders online and get served from nearby outlets. The eCommerce solution uses customer location with a multi-store feature, with features such as adult age confirmation, store locations with a map, nearest store finder using Google Maps API, email order, function and party quotes, compliments and comments feature, etc. The solution helped Super Liquor create an online presence, introduce the facility for new customers to order online, and provide a new experience for loyal customers"
            }
      ]
  
  }


  ]